/*
 * STM32 - CAN (Controller area network) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef STM32_CAN_H_
#define STM32_CAN_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/stm32/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_STM32_CAN DEVICE_PATH_STM32 "CAN"

// ----------------------------------------------------------------------------

// Note: the "port-index" property has type "int".
typedef enum {
    // TODO: keep this list in ascending order.
    STM32_PORT_CAN1,
    STM32_PORT_CAN2,
    STM32_PORT_CAN_UNDEFINED = 0xFF,
} stm32_can_index_t;

// ----------------------------------------------------------------------------

#define TYPE_STM32_CAN TYPE_STM32_PREFIX "can" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_STM32_CAN_PARENT TYPE_PERIPHERAL
typedef PeripheralClass STM32CANParentClass;
typedef PeripheralState STM32CANParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define STM32_CAN_GET_CLASS(obj) \
    OBJECT_GET_CLASS(STM32CANClass, (obj), TYPE_STM32_CAN)
#define STM32_CAN_CLASS(klass) \
    OBJECT_CLASS_CHECK(STM32CANClass, (klass), TYPE_STM32_CAN)

typedef struct {
    // private: 
    STM32CANParentClass parent_class;
    // public: 

    // None, so far.
} STM32CANClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define STM32_CAN_STATE(obj) \
    OBJECT_CHECK(STM32CANState, (obj), TYPE_STM32_CAN)

typedef struct {
    // private:
    STM32CANParentState parent_obj;
    // public:

    const STM32Capabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    // Remove it if there is only one port
    stm32_can_index_t port_index;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // F4 CAN (Controller area network) registers.
        struct { 
          Object *mcr; // 0x0 (Master control register) 
          Object *msr; // 0x4 (Master status register) 
          Object *tsr; // 0x8 (Transmit status register) 
          Object *rf0r; // 0xC (Receive FIFO 0 register) 
          Object *rf1r; // 0x10 (Receive FIFO 1 register) 
          Object *ier; // 0x14 (Interrupt enable register) 
          Object *esr; // 0x18 (Interrupt enable register) 
          Object *btr; // 0x1C (Bit timing register) 
          Object *ti0r; // 0x180 (TX mailbox identifier register) 
          Object *tdt0r; // 0x184 (Mailbox data length control and time stamp register) 
          Object *tdl0r; // 0x188 (Mailbox data low register) 
          Object *tdh0r; // 0x18C (Mailbox data high register) 
          Object *ti1r; // 0x190 (Mailbox identifier register) 
          Object *tdt1r; // 0x194 (Mailbox data length control and time stamp register) 
          Object *tdl1r; // 0x198 (Mailbox data low register) 
          Object *tdh1r; // 0x19C (Mailbox data high register) 
          Object *ti2r; // 0x1A0 (Mailbox identifier register) 
          Object *tdt2r; // 0x1A4 (Mailbox data length control and time stamp register) 
          Object *tdl2r; // 0x1A8 (Mailbox data low register) 
          Object *tdh2r; // 0x1AC (Mailbox data high register) 
          Object *ri0r; // 0x1B0 (Receive FIFO mailbox identifier register) 
          Object *rdt0r; // 0x1B4 (Mailbox data high register) 
          Object *rdl0r; // 0x1B8 (Mailbox data high register) 
          Object *rdh0r; // 0x1BC (Receive FIFO mailbox data high register) 
          Object *ri1r; // 0x1C0 (Mailbox data high register) 
          Object *rdt1r; // 0x1C4 (Mailbox data high register) 
          Object *rdl1r; // 0x1C8 (Mailbox data high register) 
          Object *rdh1r; // 0x1CC (Mailbox data high register) 
          Object *fmr; // 0x200 (Filter master register) 
          Object *fm1r; // 0x204 (Filter mode register) 
          Object *fs1r; // 0x20C (Filter scale register) 
          Object *ffa1r; // 0x214 (Filter FIFO assignment register) 
          Object *fa1r; // 0x21C (Filter activation register) 
          Object *f0r1; // 0x240 (Filter bank 0 register 1) 
          Object *f0r2; // 0x244 (Filter bank 0 register 2) 
          Object *f1r1; // 0x248 (Filter bank 1 register 1) 
          Object *f1r2; // 0x24C (Filter bank 1 register 2) 
          Object *f2r1; // 0x250 (Filter bank 2 register 1) 
          Object *f2r2; // 0x254 (Filter bank 2 register 2) 
          Object *f3r1; // 0x258 (Filter bank 3 register 1) 
          Object *f3r2; // 0x25C (Filter bank 3 register 2) 
          Object *f4r1; // 0x260 (Filter bank 4 register 1) 
          Object *f4r2; // 0x264 (Filter bank 4 register 2) 
          Object *f5r1; // 0x268 (Filter bank 5 register 1) 
          Object *f5r2; // 0x26C (Filter bank 5 register 2) 
          Object *f6r1; // 0x270 (Filter bank 6 register 1) 
          Object *f6r2; // 0x274 (Filter bank 6 register 2) 
          Object *f7r1; // 0x278 (Filter bank 7 register 1) 
          Object *f7r2; // 0x27C (Filter bank 7 register 2) 
          Object *f8r1; // 0x280 (Filter bank 8 register 1) 
          Object *f8r2; // 0x284 (Filter bank 8 register 2) 
          Object *f9r1; // 0x288 (Filter bank 9 register 1) 
          Object *f9r2; // 0x28C (Filter bank 9 register 2) 
          Object *f10r1; // 0x290 (Filter bank 10 register 1) 
          Object *f10r2; // 0x294 (Filter bank 10 register 2) 
          Object *f11r1; // 0x298 (Filter bank 11 register 1) 
          Object *f11r2; // 0x29C (Filter bank 11 register 2) 
          Object *f12r1; // 0x2A0 (Filter bank 4 register 1) 
          Object *f12r2; // 0x2A4 (Filter bank 12 register 2) 
          Object *f13r1; // 0x2A8 (Filter bank 13 register 1) 
          Object *f13r2; // 0x2AC (Filter bank 13 register 2) 
          Object *f14r1; // 0x2B0 (Filter bank 14 register 1) 
          Object *f14r2; // 0x2B4 (Filter bank 14 register 2) 
          Object *f15r1; // 0x2B8 (Filter bank 15 register 1) 
          Object *f15r2; // 0x2BC (Filter bank 15 register 2) 
          Object *f16r1; // 0x2C0 (Filter bank 16 register 1) 
          Object *f16r2; // 0x2C4 (Filter bank 16 register 2) 
          Object *f17r1; // 0x2C8 (Filter bank 17 register 1) 
          Object *f17r2; // 0x2CC (Filter bank 17 register 2) 
          Object *f18r1; // 0x2D0 (Filter bank 18 register 1) 
          Object *f18r2; // 0x2D4 (Filter bank 18 register 2) 
          Object *f19r1; // 0x2D8 (Filter bank 19 register 1) 
          Object *f19r2; // 0x2DC (Filter bank 19 register 2) 
          Object *f20r1; // 0x2E0 (Filter bank 20 register 1) 
          Object *f20r2; // 0x2E4 (Filter bank 20 register 2) 
          Object *f21r1; // 0x2E8 (Filter bank 21 register 1) 
          Object *f21r2; // 0x2EC (Filter bank 21 register 2) 
          Object *f22r1; // 0x2F0 (Filter bank 22 register 1) 
          Object *f22r2; // 0x2F4 (Filter bank 22 register 2) 
          Object *f23r1; // 0x2F8 (Filter bank 23 register 1) 
          Object *f23r2; // 0x2FC (Filter bank 23 register 2) 
          Object *f24r1; // 0x300 (Filter bank 24 register 1) 
          Object *f24r2; // 0x304 (Filter bank 24 register 2) 
          Object *f25r1; // 0x308 (Filter bank 25 register 1) 
          Object *f25r2; // 0x30C (Filter bank 25 register 2) 
          Object *f26r1; // 0x310 (Filter bank 26 register 1) 
          Object *f26r2; // 0x314 (Filter bank 26 register 2) 
          Object *f27r1; // 0x318 (Filter bank 27 register 1) 
          Object *f27r2; // 0x31C (Filter bank 27 register 2) 
        } reg;

        struct { 
          
          // MCR (Master control register) bitfields.
          struct { 
            Object *inrq; // [0:0] INRQ 
            Object *sleep; // [1:1] SLEEP 
            Object *txfp; // [2:2] TXFP 
            Object *rflm; // [3:3] RFLM 
            Object *nart; // [4:4] NART 
            Object *awum; // [5:5] AWUM 
            Object *abom; // [6:6] ABOM 
            Object *ttcm; // [7:7] TTCM 
            Object *reset; // [15:15] RESET 
            Object *dbf; // [16:16] DBF  
          } mcr; 
          
          // MSR (Master status register) bitfields.
          struct { 
            Object *inak; // [0:0] INAK 
            Object *slak; // [1:1] SLAK 
            Object *erri; // [2:2] ERRI 
            Object *wkui; // [3:3] WKUI 
            Object *slaki; // [4:4] SLAKI 
            Object *txm; // [8:8] TXM 
            Object *rxm; // [9:9] RXM 
