/*
 * STM32 - DMA (DMA controller) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef STM32_DMA_H_
#define STM32_DMA_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/stm32/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_STM32_DMA DEVICE_PATH_STM32 "DMA"

// ----------------------------------------------------------------------------

// Note: the "port-index" property has type "int".
typedef enum {
    // TODO: keep this list in ascending order.
    STM32_PORT_DMA1,
    STM32_PORT_DMA2,
    STM32_PORT_DMA_UNDEFINED = 0xFF,
} stm32_dma_index_t;

// ----------------------------------------------------------------------------

#define TYPE_STM32_DMA TYPE_STM32_PREFIX "dma" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_STM32_DMA_PARENT TYPE_PERIPHERAL
typedef PeripheralClass STM32DMAParentClass;
typedef PeripheralState STM32DMAParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define STM32_DMA_GET_CLASS(obj) \
    OBJECT_GET_CLASS(STM32DMAClass, (obj), TYPE_STM32_DMA)
#define STM32_DMA_CLASS(klass) \
    OBJECT_CLASS_CHECK(STM32DMAClass, (klass), TYPE_STM32_DMA)

typedef struct {
    // private: 
    STM32DMAParentClass parent_class;
    // public: 

    // None, so far.
} STM32DMAClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define STM32_DMA_STATE(obj) \
    OBJECT_CHECK(STM32DMAState, (obj), TYPE_STM32_DMA)

typedef struct {
    // private:
    STM32DMAParentState parent_obj;
    // public:

    const STM32Capabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    // Remove it if there is only one port
    stm32_dma_index_t port_index;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // F4 DMA (DMA controller) registers.
        struct { 
          Object *lisr; // 0x0 (Low interrupt status register) 
          Object *hisr; // 0x4 (High interrupt status register) 
          Object *lifcr; // 0x8 (Low interrupt flag clear register) 
          Object *hifcr; // 0xC (High interrupt flag clear register) 
          Object *s0cr; // 0x10 (Stream x configuration register) 
          Object *s0ndtr; // 0x14 (Stream x number of data register) 
          Object *s0par; // 0x18 (Stream x peripheral address register) 
          Object *s0m0ar; // 0x1C (Stream x memory 0 address register) 
          Object *s0m1ar; // 0x20 (Stream x memory 1 address register) 
          Object *s0fcr; // 0x24 (Stream x FIFO control register) 
          Object *s1cr; // 0x28 (Stream x configuration register) 
          Object *s1ndtr; // 0x2C (Stream x number of data register) 
          Object *s1par; // 0x30 (Stream x peripheral address register) 
          Object *s1m0ar; // 0x34 (Stream x memory 0 address register) 
          Object *s1m1ar; // 0x38 (Stream x memory 1 address register) 
          Object *s1fcr; // 0x3C (Stream x FIFO control register) 
          Object *s2cr; // 0x40 (Stream x configuration register) 
          Object *s2ndtr; // 0x44 (Stream x number of data register) 
          Object *s2par; // 0x48 (Stream x peripheral address register) 
          Object *s2m0ar; // 0x4C (Stream x memory 0 address register) 
          Object *s2m1ar; // 0x50 (Stream x memory 1 address register) 
          Object *s2fcr; // 0x54 (Stream x FIFO control register) 
          Object *s3cr; // 0x58 (Stream x configuration register) 
          Object *s3ndtr; // 0x5C (Stream x number of data register) 
          Object *s3par; // 0x60 (Stream x peripheral address register) 
          Object *s3m0ar; // 0x64 (Stream x memory 0 address register) 
          Object *s3m1ar; // 0x68 (Stream x memory 1 address register) 
          Object *s3fcr; // 0x6C (Stream x FIFO control register) 
          Object *s4cr; // 0x70 (Stream x configuration register) 
          Object *s4ndtr; // 0x74 (Stream x number of data register) 
          Object *s4par; // 0x78 (Stream x peripheral address register) 
          Object *s4m0ar; // 0x7C (Stream x memory 0 address register) 
          Object *s4m1ar; // 0x80 (Stream x memory 1 address register) 
          Object *s4fcr; // 0x84 (Stream x FIFO control register) 
          Object *s5cr; // 0x88 (Stream x configuration register) 
          Object *s5ndtr; // 0x8C (Stream x number of data register) 
          Object *s5par; // 0x90 (Stream x peripheral address register) 
          Object *s5m0ar; // 0x94 (Stream x memory 0 address register) 
          Object *s5m1ar; // 0x98 (Stream x memory 1 address register) 
          Object *s5fcr; // 0x9C (Stream x FIFO control register) 
          Object *s6cr; // 0xA0 (Stream x configuration register) 
          Object *s6ndtr; // 0xA4 (Stream x number of data register) 
          Object *s6par; // 0xA8 (Stream x peripheral address register) 
          Object *s6m0ar; // 0xAC (Stream x memory 0 address register) 
          Object *s6m1ar; // 0xB0 (Stream x memory 1 address register) 
          Object *s6fcr; // 0xB4 (Stream x FIFO control register) 
          Object *s7cr; // 0xB8 (Stream x configuration register) 
          Object *s7ndtr; // 0xBC (Stream x number of data register) 
          Object *s7par; // 0xC0 (Stream x peripheral address register) 
          Object *s7m0ar; // 0xC4 (Stream x memory 0 address register) 
          Object *s7m1ar; // 0xC8 (Stream x memory 1 address register) 
          Object *s7fcr; // 0xCC (Stream x FIFO control register) 
        } reg;

        struct { 
          
          // LISR (Low interrupt status register) bitfields.
          struct { 
            Object *feif0; // [0:0] Stream x FIFO error interrupt flag (x=3..0) 
            Object *dmeif0; // [2:2] Stream x direct mode error interrupt flag (x=3..0) 
            Object *teif0; // [3:3] Stream x transfer error interrupt flag (x=3..0) 
            Object *htif0; // [4:4] Stream x half transfer interrupt flag (x=3..0) 
            Object *tcif0; // [5:5] Stream x transfer complete interrupt flag (x = 3..0) 
            Object *feif1; // [6:6] Stream x FIFO error interrupt flag (x=3..0) 
            Object *dmeif1; // [8:8] Stream x direct mode error interrupt flag (x=3..0) 
            Object *teif1; // [9:9] Stream x transfer error interrupt flag (x=3..0) 
            Object *htif1; // [10:10] Stream x half transfer interrupt flag (x=3..0) 
