/*
 * STM32 - OTG_HS_DEVICE (USB on the go high speed) emulation.
 *
 * Copyright (c) 2016 Liviu Ionescu.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#ifndef STM32_OTG_HS_DEVICE_H_
#define STM32_OTG_HS_DEVICE_H_

#include "qemu/osdep.h"

#include <hw/cortexm/peripheral.h>
#include <hw/cortexm/stm32/capabilities.h>

// ----------------------------------------------------------------------------

#define DEVICE_PATH_STM32_OTG_HS_DEVICE DEVICE_PATH_STM32 "OTG_HS_DEVICE"



// ----------------------------------------------------------------------------

#define TYPE_STM32_OTG_HS_DEVICE TYPE_STM32_PREFIX "otg_hs_device" TYPE_PERIPHERAL_SUFFIX

// ----------------------------------------------------------------------------

// Parent definitions.
#define TYPE_STM32_OTG_HS_DEVICE_PARENT TYPE_PERIPHERAL
typedef PeripheralClass STM32OTG_HS_DEVICEParentClass;
typedef PeripheralState STM32OTG_HS_DEVICEParentState;

// ----------------------------------------------------------------------------

// Class definitions.
#define STM32_OTG_HS_DEVICE_GET_CLASS(obj) \
    OBJECT_GET_CLASS(STM32OTG_HS_DEVICEClass, (obj), TYPE_STM32_OTG_HS_DEVICE)
#define STM32_OTG_HS_DEVICE_CLASS(klass) \
    OBJECT_CLASS_CHECK(STM32OTG_HS_DEVICEClass, (klass), TYPE_STM32_OTG_HS_DEVICE)

typedef struct {
    // private: 
    STM32OTG_HS_DEVICEParentClass parent_class;
    // public: 

    // None, so far.
} STM32OTG_HS_DEVICEClass;

// ----------------------------------------------------------------------------

// Instance definitions.
#define STM32_OTG_HS_DEVICE_STATE(obj) \
    OBJECT_CHECK(STM32OTG_HS_DEVICEState, (obj), TYPE_STM32_OTG_HS_DEVICE)

typedef struct {
    // private:
    STM32OTG_HS_DEVICEParentState parent_obj;
    // public:

    const STM32Capabilities *capabilities;

    // TODO: remove this if the peripheral is always enabled.
    // Points to the bitfield that enables the peripheral.
    Object *enabling_bit;

    union {
      // ----- 8< ----- 8< -----  8< ----- 8< ----- 8< ----- 8< ----- 8< -----

      // DO NOT REMOVE FIELDS! Automatically generated!
      // Merge fields from different family members.
      struct {
        // F4 OTG_HS_DEVICE (USB on the go high speed) registers.
        struct { 
          Object *otg_hs_dcfg; // 0x0 (OTG_HS device configuration register) 
          Object *otg_hs_dctl; // 0x4 (OTG_HS device control register) 
          Object *otg_hs_dsts; // 0x8 (OTG_HS device status register) 
          Object *otg_hs_diepmsk; // 0x10 (OTG_HS device IN endpoint common interrupt mask register) 
          Object *otg_hs_doepmsk; // 0x14 (OTG_HS device OUT endpoint common interrupt mask register) 
          Object *otg_hs_daint; // 0x18 (OTG_HS device all endpoints interrupt register) 
          Object *otg_hs_daintmsk; // 0x1C (OTG_HS all endpoints interrupt mask register) 
          Object *otg_hs_dvbusdis; // 0x28 (OTG_HS device VBUS discharge time register) 
          Object *otg_hs_dvbuspulse; // 0x2C (OTG_HS device VBUS pulsing time register) 
          Object *otg_hs_dthrctl; // 0x30 (OTG_HS Device threshold control register) 
          Object *otg_hs_diepempmsk; // 0x34 (OTG_HS device IN endpoint FIFO empty interrupt mask register) 
          Object *otg_hs_deachint; // 0x38 (OTG_HS device each endpoint interrupt register) 
          Object *otg_hs_deachintmsk; // 0x3C (OTG_HS device each endpoint interrupt register mask) 
          Object *otg_hs_diepeachmsk1; // 0x40 (OTG_HS device each in endpoint-1 interrupt register) 
          Object *otg_hs_doepeachmsk1; // 0x80 (OTG_HS device each OUT endpoint-1 interrupt register) 
          Object *otg_hs_diepctl0; // 0x100 (OTG device endpoint-0 control register) 
          Object *otg_hs_diepctl1; // 0x120 (OTG device endpoint-1 control register) 
          Object *otg_hs_diepctl2; // 0x140 (OTG device endpoint-2 control register) 
          Object *otg_hs_diepctl3; // 0x160 (OTG device endpoint-3 control register) 
          Object *otg_hs_diepctl4; // 0x180 (OTG device endpoint-4 control register) 
          Object *otg_hs_diepctl5; // 0x1A0 (OTG device endpoint-5 control register) 
          Object *otg_hs_diepctl6; // 0x1C0 (OTG device endpoint-6 control register) 
          Object *otg_hs_diepctl7; // 0x1E0 (OTG device endpoint-7 control register) 
          Object *otg_hs_diepint0; // 0x108 (OTG device endpoint-0 interrupt register) 
          Object *otg_hs_diepint1; // 0x128 (OTG device endpoint-1 interrupt register) 
          Object *otg_hs_diepint2; // 0x148 (OTG device endpoint-2 interrupt register) 
          Object *otg_hs_diepint3; // 0x168 (OTG device endpoint-3 interrupt register) 
          Object *otg_hs_diepint4; // 0x188 (OTG device endpoint-4 interrupt register) 
          Object *otg_hs_diepint5; // 0x1A8 (OTG device endpoint-5 interrupt register) 
          Object *otg_hs_diepint6; // 0x1C8 (OTG device endpoint-6 interrupt register) 
          Object *otg_hs_diepint7; // 0x1E8 (OTG device endpoint-7 interrupt register) 
          Object *otg_hs_dieptsiz0; // 0x110 (OTG_HS device IN endpoint 0 transfer size register) 
          Object *otg_hs_diepdma1; // 0x114 (OTG_HS device endpoint-1 DMA address register) 
          Object *otg_hs_diepdma2; // 0x134 (OTG_HS device endpoint-2 DMA address register) 
          Object *otg_hs_diepdma3; // 0x154 (OTG_HS device endpoint-3 DMA address register) 
          Object *otg_hs_diepdma4; // 0x174 (OTG_HS device endpoint-4 DMA address register) 
          Object *otg_hs_diepdma5; // 0x194 (OTG_HS device endpoint-5 DMA address register) 
          Object *otg_hs_dtxfsts0; // 0x118 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dtxfsts1; // 0x138 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dtxfsts2; // 0x158 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dtxfsts3; // 0x178 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dtxfsts4; // 0x198 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dtxfsts5; // 0x1B8 (OTG_HS device IN endpoint transmit FIFO status register) 
          Object *otg_hs_dieptsiz1; // 0x130 (OTG_HS device endpoint transfer size register) 
          Object *otg_hs_dieptsiz2; // 0x150 (OTG_HS device endpoint transfer size register) 
          Object *otg_hs_dieptsiz3; // 0x170 (OTG_HS device endpoint transfer size register) 
          Object *otg_hs_dieptsiz4; // 0x190 (OTG_HS device endpoint transfer size register) 
          Object *otg_hs_dieptsiz5; // 0x1B0 (OTG_HS device endpoint transfer size register) 
          Object *otg_hs_doepctl0; // 0x300 (OTG_HS device control OUT endpoint 0 control register) 
          Object *otg_hs_doepctl1; // 0x320 (OTG device endpoint-1 control register) 
          Object *otg_hs_doepctl2; // 0x340 (OTG device endpoint-2 control register) 
          Object *otg_hs_doepctl3; // 0x360 (OTG device endpoint-3 control register) 
          Object *otg_hs_doepint0; // 0x308 (OTG_HS device endpoint-0 interrupt register) 
          Object *otg_hs_doepint1; // 0x328 (OTG_HS device endpoint-1 interrupt register) 
          Object *otg_hs_doepint2; // 0x348 (OTG_HS device endpoint-2 interrupt register) 
          Object *otg_hs_doepint3; // 0x368 (OTG_HS device endpoint-3 interrupt register) 
          Object *otg_hs_doepint4; // 0x388 (OTG_HS device endpoint-4 interrupt register) 
          Object *otg_hs_doepint5; // 0x3A8 (OTG_HS device endpoint-5 interrupt register) 
          Object *otg_hs_doepint6; // 0x3C8 (OTG_HS device endpoint-6 interrupt register) 
          Object *otg_hs_doepint7; // 0x3E8 (OTG_HS device endpoint-7 interrupt register) 
          Object *otg_hs_doeptsiz0; // 0x310 (OTG_HS device endpoint-1 transfer size register) 
          Object *otg_hs_doeptsiz1; // 0x330 (OTG_HS device endpoint-2 transfer size register) 
          Object *otg_hs_doeptsiz2; // 0x350 (OTG_HS device endpoint-3 transfer size register) 
          Object *otg_hs_doeptsiz3; // 0x370 (OTG_HS device endpoint-4 transfer size register) 
          Object *otg_hs_doeptsiz4; // 0x390 (OTG_HS device endpoint-5 transfer size register) 
        } reg;

        struct { 
          
          // OTG_HS_DCFG (OTG_HS device configuration register) bitfields.
          struct { 
            Object *dspd; // [0:1] Device speed 
            Object *nzlsohsk; // [2:2] Nonzero-length status OUT handshake 
            Object *dad; // [4:10] Device address 
            Object *pfivl; // [11:12] Periodic (micro)frame interval 
            Object *perschivl; // [24:25] Periodic scheduling interval  
          } otg_hs_dcfg; 
          
          // OTG_HS_DCTL (OTG_HS device control register) bitfields.
          struct { 
            Object *rwusig; // [0:0] Remote wakeup signaling 
            Object *sdis; // [1:1] Soft disconnect 
            Object *ginsts; // [2:2] Global IN NAK status 
            Object *gonsts; // [3:3] Global OUT NAK status 
            Object *tctl; // [4:6] Test control 
